<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<!--
  Jamf Pro Configuration Profile for Cortex Code Managed Settings

  INSTRUCTIONS:
  1. Replace [COMPANY] with your organization name
  2. Adjust settings as needed for your security requirements
  3. Upload to Jamf Pro as a Custom Configuration Profile
  4. Scope to appropriate device groups

  This profile:
  - Creates /Library/Application Support/Cortex/ directory
  - Deploys managed-settings.json with org policy
  - Prevents users from bypassing restrictions
-->
<plist version="1.0">
<dict>
    <key>PayloadContent</key>
    <array>
        <dict>
            <key>PayloadType</key>
            <string>com.apple.ManagedClient.preferences</string>
            <key>PayloadVersion</key>
            <integer>1</integer>
            <key>PayloadIdentifier</key>
            <string>com.company.cortex.settings</string>
            <key>PayloadUUID</key>
            <string>GENERATE-NEW-UUID-HERE</string>
            <key>PayloadDisplayName</key>
            <string>Cortex Code Managed Settings</string>
            <key>PayloadDescription</key>
            <string>Organization policy for Cortex Code CLI</string>
            <key>PayloadOrganization</key>
            <string>[COMPANY]</string>
            <key>PayloadEnabled</key>
            <true/>

            <!--
              NOTE: Jamf Custom Settings profiles don't directly create files.
              Use a script deployment instead. This profile shows the structure.

              For actual deployment, use a Jamf Policy with a script that:
              1. Creates the directory
              2. Writes the JSON file
              3. Sets appropriate permissions
            -->
        </dict>
    </array>

    <key>PayloadDisplayName</key>
    <string>Cortex Code Governance</string>
    <key>PayloadDescription</key>
    <string>Configures Cortex Code CLI with organization security policy</string>
    <key>PayloadIdentifier</key>
    <string>com.company.cortex.governance</string>
    <key>PayloadOrganization</key>
    <string>[COMPANY]</string>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadUUID</key>
    <string>GENERATE-NEW-UUID-HERE</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
</dict>
</plist>

<!--
  JAMF SCRIPT FOR ACTUAL DEPLOYMENT:

  #!/bin/bash
  # Deploy Cortex Code managed-settings.json

  CONFIG_DIR="/Library/Application Support/Cortex"
  CONFIG_FILE="$CONFIG_DIR/managed-settings.json"

  # Create directory
  mkdir -p "$CONFIG_DIR"

  # Write configuration
  cat > "$CONFIG_FILE" << 'EOF'
  {
    "version": "1.0",
    "permissions": {
      "dangerouslyAllowAll": false,
      "defaultMode": "allow"
    },
    "settings": {
      "forceSandboxEnabled": true
    },
    "required": {
      "minimumVersion": "1.0.0"
    },
    "ui": {
      "showManagedBanner": true,
      "bannerText": "[COMPANY] Managed - v1.0",
      "hideDangerousOptions": true
    }
  }
  EOF

  # Set permissions
  chmod 644 "$CONFIG_FILE"
  chown root:wheel "$CONFIG_FILE"

  echo "Cortex Code managed settings deployed successfully"
  exit 0
-->
